0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fixedWall 
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    ramp 
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    front 
    {
        type            empty;
    }

    back 
    {
        type            empty;
    }

    ground 
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    atmosphere
    {
        type            calculated;
        value           uniform 0;
    }

    inlet 
    {
        type            calculated;
        value           uniform 0;
    }

    outlet 
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
